In [1]:
import pandas as pd

In [12]:
df = pd.read_csv('players_20.csv')
df = df.set_index('short_name')
df = df.loc[:, 'age':'club']
df.head()

,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,
L. Messi,32,1987-06-24,170,72,Argentina,FC Barcelona
Cristiano Ronaldo,34,1985-02-05,187,83,Portugal,Juventus
Neymar Jr,27,1992-02-05,175,68,Brazil,Paris Saint-Germain
J. Oblak,26,1993-01-07,188,87,Slovenia,Atlético Madrid
E. Hazard,28,1991-01-07,175,74,Belgium,Real Madrid

### Selecting single value

###  .iloc() method

syntax = df.iloc[row_position,column_position]

In [13]:
# select the height of the Messi
df.iloc[0,2]

np.int64(170)

In [14]:
# get all the rows inside the height_cm col
df.iloc[:, 2]

short_name
L. Messi             170
Cristiano Ronaldo    187
Neymar Jr            175
J. Oblak             188
E. Hazard            175
                    ...
Shao Shuai           186
Xiao Mingjie         177
Zhang Wei            186
Wang Haijian         185
Pan Ximing           182
Name: height_cm, Length: 18278, dtype: int64

In [15]:
# get all the cols that correspond to index messi
df.iloc[0,:]

age                      32
dob              1987-06-24
height_cm               170
weight_kg                72
nationality       Argentina
club           FC Barcelona
Name: L. Messi, dtype: object

### Selecting with list of values

In [16]:
# get all the data about L.messi and Cristiano
df.iloc[[0,1], :]

,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,
L. Messi,32,1987-06-24,170,72,Argentina,FC Barcelona
Cristiano Ronaldo,34,1985-02-05,187,83,Portugal,Juventus

In [17]:
# get the height of L messi and Ronaldo
df.iloc[[0,1],2]

short_name
L. Messi             170
Cristiano Ronaldo    187
Name: height_cm, dtype: int64

In [20]:
# get height and weight of Messi
df.iloc[0,[2,3]]

height_cm    170
weight_kg     72
Name: L. Messi, dtype: object

In [21]:
# get height and weight  of messi and ronaldo
df.iloc[[0,1],[2,3]]

                   height_cm  weight_kg
short_name
L. Messi                 170         72
Cristiano Ronaldo        187         83

### Selecting a range of data with a slice

start:end here in iloc methods start is included but end is excluded

In [25]:
# slice col labels age/club ,  players = messi and ronaldo
df.iloc[[0,1],0:7] # either we can define players var

,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,
L. Messi,32,1987-06-24,170,72,Argentina,FC Barcelona
Cristiano Ronaldo,34,1985-02-05,187,83,Portugal,Juventus

In [28]:
# slice index labels (top1 to top10) cols: age to club
df.iloc[0:10,0:7] # same can be done by defining the var

,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,
L. Messi,32,1987-06-24,170,72,Argentina,FC Barcelona
Cristiano Ronaldo,34,1985-02-05,187,83,Portugal,Juventus
Neymar Jr,27,1992-02-05,175,68,Brazil,Paris Saint-Germain
J. Oblak,26,1993-01-07,188,87,Slovenia,Atlético Madrid
E. Hazard,28,1991-01-07,175,74,Belgium,Real Madrid
K. De Bruyne,28,1991-06-28,181,70,Belgium,Manchester City
M. ter Stegen,27,1992-04-30,187,85,Germany,FC Barcelona
V. van Dijk,27,1991-07-08,193,92,Netherlands,Liverpool
L. Modrić,33,1985-09-09,172,66,Croatia,Real Madrid
M. Salah,27,1992-06-15,175,71,Egypt,Liverpool

### Selecting with conditions

Note: In iloc method, it cannot accept a boolean series, but only a boolean list. so we have to use list() function to convert series to list

In [31]:
# select players with height above 180cm and all cols
df.iloc[list(df['height_cm']>180),:].head()

,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,
Cristiano Ronaldo,34,1985-02-05,187,83,Portugal,Juventus
J. Oblak,26,1993-01-07,188,87,Slovenia,Atlético Madrid
K. De Bruyne,28,1991-06-28,181,70,Belgium,Manchester City
M. ter Stegen,27,1992-04-30,187,85,Germany,FC Barcelona
V. van Dijk,27,1991-07-08,193,92,Netherlands,Liverpool

In [33]:
# select the players who weight is above 80kg and from england
condition1 = df['weight_kg'] > 80
condition2 = df['nationality'] == 'England' # this boolean series
# to convert series to list
list((df['weight_kg']> 80)  & (df['nationality']=='England'))
df.iloc[list((df['weight_kg']> 80) & (df['nationality']=='England')), :]

,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,
H. Kane,25,1993-07-28,188,89,England,Tottenham Hotspur
H. Maguire,26,1993-03-05,194,100,England,Manchester United
M. Keane,26,1993-01-11,191,82,England,Everton
W. Rooney,33,1985-10-24,176,83,England,DC United
B. Foster,36,1983-04-03,193,90,England,Watford
...,...,...,...,...,...,...
G. McMahon,19,2000-06-16,191,86,England,Burnley
J. Bainbridge,21,1998-05-21,188,83,England,Sunderland
E. Brown,18,2000-11-27,188,84,England,Bolton Wanderers
O. Ashley,19,2000-02-23,180,82,England,AFC Wimbledon
J. Wright,18,2001-04-10,185,82,England,Millwall